export default {
  nav: {
    siteName: 'פורטפוליו',
    home: 'בית',
    about: 'אודות',
    projects: 'פרויקטים',
    contact: 'צור קשר',
  },
  hero: {
    title: 'היי, קוראים לי',
    name: 'דור חכים',
    subtitle: 'אני מתכנת שאוהב את מה שהוא עושה.',
    description:
      'מאז ומתמיד הייתי אדם טכנולוגי, תמיד אהבתי לפתור בעיות. אחד הדברים הנהדרים בתכנות בעיני, זו היכולת ליצור משהו מאפס.',
    viewWork: 'תיק עבודות',
    getInTouch: 'דברו איתי',
  },
  about: {
    title: 'קצת עלי',
    description:
      'מתכנת עם ניסיון בבניית מערכות מאפס, תחזוקה של קוד קיים וחניכה של תלמידים בקורס תכנות.',
    journey: 'מה אני עושה',
    journeySubTitle:
      'ידע וניסיון מעמיק בטכנולוגיות: JS, TS, React, Vue, Node.js.',
    journeyText1:
      'בעיניי, קוד קריא, נקי ופשוט עדיף תמיד על קוד מסורבל ומתחכם. ארכיטקטורה נכונה והבנה מעמיקה של המערכת הן הבסיס לפיתוח איכותי.',
    journeyText2:
      'כשאני לא כותב קוד, אני אוהב לנצל את הזמן הפנוי בשביל להתאמן ולראות אנשים שאני אוהב. בעבודה אני איש החתולים, אבל יש גם כלב :)',
    connect: 'דברו איתי',
    skills: 'סטאק טכנולוגי',
  },
  projects: {
    title: 'תיק עבודות',
    description:
      'הפרויקטים המרכזיים שלי. חלקם עבור לקוחות פרטיים, חלקם פרויקטים ללימוד עצמי.',
  },
  contact: {
    title: 'צור קשר',
    description: 'רוצה ליצור איתי קשר? אני אשמח לשמוע ממך!',
    connect: 'לינקים',
    connectDescription:
      'לא אדם של רשתות חברתיות, אבל יש לי את הפלטפורמות שצריך כדי להגיע אלי :)',
    sendMessage: 'שלחו לי מייל',
    name: 'שם',
    namePlaceholder: 'השם שלך',
    email: 'אימייל',
    emailPlaceholder: 'your.email@example.com',
    message: 'הודעה',
    messagePlaceholder: 'ההודעה שלך...',
    submit: 'שלח הודעה',
    submitSuccess: 'תודה על ההודעה! אחזור אליך בקרוב.',
  },
  footer: {
    tagline: 'בונה חוויות דיגיטליות עם תשוקה ודייקנות.',
    navigation: 'ניווט',
    connect: 'התחברות',
    copyright: 'כל הזכויות שמורות.',
  },
  common: {
    link: 'לינק',
    frontend: 'צד לקוח',
    backend: 'צד שרת',
  },
}
