export default {
  nav: {
    home: 'בית',
    about: 'אודות',
    projects: 'פרויקטים',
    contact: 'צור קשר',
  },
  hero: {
    title: 'היי, אני',
    name: 'דור חכים',
    subtitle: 'מתכנת שאוהב את מה שהוא עושה.',
    description:
      'מאז ומתמיד הייתי אדם טכנולוגי, תמיד אהבתי לפתור בעיות. אחד הדברים הנהדרים בתכנות בעיני, זו היכולת ליצור משהו מאפס.',
    viewWork: 'תיק עבודות',
    getInTouch: 'דברו איתי',
  },
  about: {
    title: 'קצת עלי',
    description: 'מתכנת עם ניסיון בבניית מערכות מאפס, ותחזוקה של קוד קיים.',
    journey: 'מה אני עושה',
    journeyText1:
      'ידע וניסיון מעמיק בJS, TS, React, Vue, Node.js. קוד נקי וארכיטקטורה נכונה של פרויקט הם דברים חשובים עבורי.',
    journeyText2:
      'כשאני לא כותב קוד, אני אוהב לנצל את הזמן הפנוי בשביל להתאמן ולראות אנשים שאני אוהב. בעבודה אני איש החתולים, אבל יש גם כלב :)',
    connect: 'דברו איתי',
    skills: 'סטאק טכנולוגי',
  },
  projects: {
    title: 'תיק עבודות',
    description:
      'הפרויקטים הגדולים שלי. חלקם עבור לקוחות פרטיים, חלקם פרויקטים ללימוד עצמי.',
  },
  contact: {
    title: 'צור קשר',
    description: 'יש לך פרויקט בראש או רוצה לשתף פעולה? אשמח לשמוע ממך!',
    connect: 'בואו נתחבר',
    connectDescription:
      'אני תמיד פתוח לדון בפרויקטים חדשים, רעיונות יצירתיים, או הזדמנויות להיות חלק מהחזון שלך. אל תהסס לפנות דרך כל אחד מהערוצים האלה.',
    sendMessage: 'שלח הודעה',
    name: 'שם',
    namePlaceholder: 'השם שלך',
    email: 'אימייל',
    emailPlaceholder: 'your.email@example.com',
    message: 'הודעה',
    messagePlaceholder: 'ההודעה שלך...',
    submit: 'שלח הודעה',
    submitSuccess: 'תודה על ההודעה שלך! אחזור אליך בקרוב.',
  },
  footer: {
    tagline: 'בונה חוויות דיגיטליות עם תשוקה ודייקנות.',
    navigation: 'ניווט',
    connect: 'התחברות',
    copyright: 'כל הזכויות שמורות.',
  },
  common: {
    liveDemo: 'הדמו חי',
    github: 'GitHub',
  },
}
